Repository: dvdocumentation/nodalogic
Catalog: NodaLogicDesigner/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Profile updated successfully
ru: Профиль успешно обновлен

source: # Decoding error:
ru: # Ошибка декодирования:

source: Invalid email or password
ru: Неверный адрес электронной почты или пароль

source: Email already taken
ru: Электронная почта уже занята

source: Configuration deleted
ru: Конфигурация удалена.

source: File not selected
ru: Файл не выбран

source: Only .py files allowed
ru: Разрешены только файлы .py

source: Enter GitHub URL
ru: Введите URL-адрес GitHub

source: Use GitHub RAW URL
ru: Используйте URL-адрес GitHub RAW

source: Failed to load file
ru: Не удалось загрузить файл

source: Invalid upload type
ru: Неверный тип загрузки

source: Handlers loaded successfully
ru: Обработчики успешно загружены

source: Handlers cleared
ru: Обработчики очищены

source: Download error:
ru: Ошибка загрузки:

source: Configuration saved
ru: Конфигурация сохранена.

source: Class saved
ru: Класс сохранен.

source: Method updated successfully
ru: Метод успешно обновлен

source: Invalid actions format (JSON)
ru: Неверный формат действий (JSON)

source: Event type and at least one action required
ru: Тип события и хотя бы одно действие требуется

source: Method
ru: Метод

source: not found in class
ru: не найден в классе

source: Event with this event+listener already exists
ru: Событие с этим событием+прослушивателем уже существует

source: Event added
ru: Событие добавлено

source: Original event not found
ru: Исходное событие не найдено

source: Method %(mname)s not found in class
ru: Метод %(mname)s не найден в классе

source: Event updated
ru: Событие обновлено

source: Event not found
ru: Событие не найдено

source: Event deleted
ru: Мероприятие удалено.

source: New configuration
ru: Новая конфигурация

source: Class name not specified
ru: Имя класса не указано

source: Class name must start with a letter or underscore and contain only letters, numbers and underscores
ru: Имя класса должно начинаться с буквы или подчеркивания и содержать только буквы, цифры и подчеркивания.

source: Class with this name already exists
ru: Класс с таким названием уже существует

source: Class created successfully
ru: Класс успешно создан

source: Only NOD files allowed
ru: Разрешены только файлы NOD.

source: You do not have permission to update this configuration
ru: У вас пока нет конфигураций.

source: Imported configuration
ru: Загрузить конфигурацию

source: Configuration updated successfully
ru: Конфигурация успешно импортирована

source: Configuration imported successfully
ru: Конфигурация успешно импортирована

source: Import error: {error}
ru: Ошибка импорта: {error}

source: Only JSON files allowed
ru: Разрешены только файлы JSON.

source: Method saved successfully
ru: Метод успешно сохранен

source: Save error:
ru: Ошибка сохранения:

source: Configuration updated
ru: Конфигурация обновлена

source: Empty handler code received
ru: Получен пустой код обработчика

source: Python syntax error
ru: Синтаксическая ошибка Python

source: Syntax error after adding imports:
ru: Синтаксическая ошибка после добавления импорта:

source: Code saved successfully
ru: Код успешно сохранен

source: Save error:
ru: Ошибка сохранения:

source: Dataset updated successfully
ru: Датасет успешно обновлен.

source: GitHub load error:
ru: Ошибка загрузки GitHub:

source: Server handlers loaded successfully
ru: Обработчики сервера успешно загружены

source: No server handlers available for download
ru: Нет доступных для скачивания обработчиков серверов.

source: Server handlers deleted
ru: Обработчики сервера удалены

source: Empty server handler code received
ru: Получен пустой код обработчика сервера

source: Server handler code saved successfully
ru: Код обработчика сервера успешно сохранен.

source: Server handler save error:
ru: Ошибка сохранения обработчика сервера:

source: Server added
ru: Сервер добавлен

source: Server deleted
ru: Сервер удален

source: Server updated
ru: Сервер обновлен

source: Home
ru: Домой

source: Edit configuration
ru: Изменить конфигурацию

source: Configurations
ru: Конфигурации

source: Classes
ru: Классы

source: Android/Python handlers
ru: Обработчики Android/Python

source: Server/Python handlers
ru: Обработчики сервера/Python

source: Datasets
ru: Датасет

source: Servers
ru: Серверы

source: Common events
ru: Общие события

source: General settings
ru: Общие настройки

source: Configuration API QR-code
ru: QR-код API конфигурации

source: Configuration name
ru: Имя конфигурации

source: Version
ru: Версия

source: *Server name?
ru: *Имя сервера?

source: Vendor
ru: Поставщик

source: Last modified
ru: Последнее изменение

source: Save
ru: Сохранить

source: Configuration uploading/downdloading
ru: Загрузка/выгрузка конфигурации

source: Configuration download
ru: Загрузка конфигурации

source: Download the full configuration in JSON format
ru: Загрузите полную конфигурацию в формате JSON.

source: Download configuration
ru: Скачать конфигурацию

source: Configuration uploading
ru: Загрузка конфигурации

source: Load configuration from JSON file (existing data will be overwritten)
ru: Загрузить конфигурацию из файла JSON (существующие данные будут перезаписаны)

source: Upload configuration
ru: Загрузить конфигурацию

source: Sections
ru: Разделы

source: Add section
ru: Добавить раздел

source: ID
ru: Имя(ID)

source: Title
ru: Заголовок

source: Actions
ru: Действия

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

source: Add class
ru: Добавить класс

source: Class name
ru: Имя класса

source: A class name must begin with a letter or underscore and contain only letters, numbers, and underscores.
ru: Имя класса должно начинаться с буквы или подчеркивания и содержать только буквы, цифры и подчеркивания.

source: Used to create a class in Python
ru: Используется для создания класса в Python

source: Create class
ru: Создать класс

source: Name
ru: Имя

source: Methods count
ru: Количество методов

source: Handlers upload
ru: Импорт обработчиков

source: Code editor
ru: Редактор кода

source: Upload handlers
ru: Загрузить обработчики

source: Upload py-file
ru: Загрузите py-файл

source: GitHub link
ru: Ссылка на GitHub

source: Select py-file :
ru: Выберите py-файл:

source: Upload
ru: Загрузить

source: GitHub raw URL:
ru: Необработанный URL-адрес GitHub:

source: Download file
ru: Скачать файл

source: Delete handlers code
ru: Удалить код обработчиков

source: Edit handlers code
ru: Редактировать код обработчиков

source: No handlers code added
ru: Код обработчиков не добавлен

source: Upload handlers code
ru: Загрузить код обработчиков

source: Upload file
ru: Загрузить файл

source: GitHab link
ru: Ссылка на GitHub

source: Select py-file
ru: Выберите py-файл

source: Server handlers code editior
ru: Редактор кода обработчиков сервера

source: No added handlers
ru: Нет добавленных обработчиков

source: Add dataset
ru: Добавить датасет

source: Dataset name
ru: Имя датасета

source: Hash-indexes
ru: Хэш-индексы

source: Text-indexes
ru: Текстовые индексы

source: Records count
ru: Количество записей

source: API for working with datasets
ru: API для работы с датасетами

source: Adding/updating records
ru: Добавление/обновление записей

source: Getting all records
ru: Получение всех записей

source: Delete all records
ru: Удаление всех записей

source: Delete one record
ru: Удалить одну запись

source: Add server
ru: Добавить сервер

source: Alias
ru: Псевдоним

source: By default
ru: По умолчанию

source: Add common event
ru: Добавить общее событие

source: Event
ru: Событие

source: Listener
ru: Зарегистрироваться

source: No common events added
ru: События не добавлены

source: Event type
ru: Тип события

source: Listener name (optional)
ru: Имя слушателя (необязательно)

source: Add action
ru: Добавить действие

source: Cancel
ru: Отмена

source: Commands
ru: Команды

source: Enter commands in the format Title|Variable
ru: Введите команды в формате Название|Переменная.

source: Fields for exact search separated by commas
ru: Поля для точного поиска, разделенные запятыми

source: Full-text search fields (comma separated)
ru: Поля полнотекстового поиска (через запятую)

source: Record template
ru: Шаблон записи

source: HTML template for displaying dataset element in input fields. For example: {name} , {_id}
ru: HTML-шаблон для отображения элемента датасета в полях ввода.Например: {имя}, {_id}

source: Autoload?*
ru: Автозагрузка? *

source: Edit dataset
ru: Редактировать датасет

source: Edit section
ru: Редактировать раздел

source: Put alias and ULR
ru: Поставьте псевдоним и ULR

source: none
ru: нет

source: server alias
ru: псевдоним сервера

source: Admin dashboard
ru: Панель администрирования

source: Total users
ru: Всего пользователей

source: Active users
ru: Активные пользователи

source: Total devices
ru: Устройства

source: Active devices
ru: Устройства

source: Users
ru: Пользователи

source: Qty devices
ru: Количество устройств

source: Status
ru: Статус

source: Active
ru: Активный

source: Unactive
ru: Активный

source: More
ru: Больше

source: User details
ru: Свойства польователя

source: Back
ru: Назад

source: Summary
ru: Общее

source: Name
ru: Имя

source: Inactive
ru: Активный

source: Statistics
ru: Статистика

source: Qty. devices
ru: Устройства

source: Configs
ru: Конфигурации

source: Devices
ru: Устройства

source: Model
ru: Модель

source: Last connection
ru: Последнее соединение

source: Token
ru: Токен

source: User not have devices
ru: У пользователя нет устройств

source: User configurations
ru: Конфигурации пользователя

source: Last update
ru: Последнее обновление

source: User not have configurations
ru: У пользователя нет конфигураций

source: created
ru: создан

source: User not have rooms
ru: У вас еще нет комнат

source: Mode
ru: Режим

source: Client
ru: Клиент

source: Logout
ru: Выход

source: Language
ru: Язык

source: Create configuration
ru: Создать конфигурацию

source: You dont have any configurations yet.
ru: У вас пока нет конфигураций.

source: Create room
ru: Создать комнату

source: Room name
ru: Название комнаты

source: Create debug room
ru: Создать комнату отладки

source: Created
ru: Созданный

source: Debug room
ru: Комната отладки

source: debug
ru: отлаживать

source: Debug
ru: Отлаживать

source: Open
ru: Открыть

source: Delete room
ru: Удалить комнату

source: You dont have any rooms yet.
ru: У вас пока нет комнат.

source: Import configuration
ru: Импортировать конфигурацию

source: Select configuration file (*.nod)
ru: Выберите файл конфигурации

source: Configuration
ru: Конфигурация

source: Edit class
ru: Изменить класс

source: General Settings
ru: Общие настройки

source: Display
ru: Отображение

source: Migration
ru: Миграция

source: The class name cannot be changed after creation
ru: Имя класса нельзя изменить после создания.

source: Used to create a class in Python. Must begin with a letter or underscore and contain only letters, numbers, and underscores.
ru: Используется для создания класса в Python.Должно начинаться с буквы или подчеркивания и содержать только буквы, цифры и подчеркивания.

source: Hidden class
ru: Скрытый класс

source: Hide class from user interface
ru: Скрыть класс из пользовательского интерфейса

source: Autosave to _data
ru: Автосохранение в _data

source: Class type
ru: Тип класса

source: -- Not specified --
ru: -- Не указан --

source: Custom process
ru: Пользовательский процесс

source: Data node
ru: Узел данных

source: User task
ru: Задача пользователя

source: Background task
ru: Фоновая задача

source: Section code
ru: Код раздела

source: Display name
ru: Отображаемое имя

source: Human-readable class name, can contain any characters.
ru: Понятное для человека имя класса, может содержать любые символы.

source: Cover
ru: Обложка

source: JSON markup for the node cover
ru: Разметка JSON для обложки узла

source: JSON markup. For example: [[{"type":"Text","value":"@ctitle","bold":true}],[{"type":"Text","value":"@cbody"}]]
ru: JSON-разметка.Например: [[{"type":"Text","value":"@ctitle","bold":true}],[{"type":"Text","value":"@cbody"}]]

source: ^layout_id (from Common Markup) or JSON layout directly
ru: ^layout_id (из Общей разметки) or JSON-разметка непосредственно

source: Hint: Header|key
ru: Пример: Заголовок|ключ

source: Use standard commands
ru: Использовать стандартные комманды

source: SVG commands
ru: SVG для rjvvfyl

source: API endpoints for working with nodes of this class
ru: API для работы с узлами класса

source: Registration command
ru: Команда Регистрация

source: Show the Register button in standard node commands.
ru: Показать команду Регистрация

source: Register on save
ru: Зарегистрировать в комнате при сохранении

source: After saving the node, register in the default room.
ru: При сохранении, зарегистрировать в текущей комнате узла

source: Default room alias
ru: Определить псевдоним комнаты

source: Methods
ru: Методы

source: Events
ru: События

source: Add method
ru: Добавить метод

source: Method name
ru: Имя метода

source: Engine/Language
ru: Двигатель/Язык

source: Delete method
ru: Удалить метод

source: No methods added
ru: Методы не добавлены

source: Add event
ru: Добавить событие

source: No events added
ru: События не добавлены

source: Method body
ru: Тело метода

source: Node instance
ru: Экземпляр узла

source: Input data
ru: Входные данные

source: Place your code here
ru: Разместите свой код здесь

source: Add
ru: Добавлять

source: Edit method
ru: Изменить метод

source: Edit event
ru: Редактировать событие

source: Adding/updating nodes
ru: Добавление/обновление записей

source: Get all nodes
ru: Получение всех записей

source: Get specific node
ru: Получить конкретный узел

source: Update _data in specific node
ru: Обновить данные в конкретном узле

source: Delete specific node
ru: Удалить выбранный узел

source: Execute node method
ru: Выполнить метод узла

source: Execute method on remote device via WebSocket
ru: Выполнить метод на удаленном устройстве через WebSocket

source: Get remote method execution result
ru: Получить результат выполнения удаленного метода

source: Common layouts
ru: Общая разметка

source: Generate laout only
ru: Генерировать только разметку

source: Add alias
ru: Добавить комнату

source: Here you can set room aliases. An alias is selected in the class (Migration tab), and upon registration it is resolved to room_uid.
ru: Здесь можно задать псевдонимы комнат. Псевдоним выбирается в классе.

source: Room
ru: Комната

source: There are no aliases yet
ru: Пока нет псевдонимов

source: Common layout
ru: Общая разметка

source: Edit Profile
ru: Редактировать профиль

source: Email
ru: Электронная почта

source: Configuration Display Name
ru: Отображаемое имя конфигурации

source: New Password
ru: Новый пароль

source: Leave blank if you do not want to change password
ru: Оставьте пустым, если не хотите менять пароль

source: Android ID
ru: Идентификатор Android

source: Last Connection
ru: Последнее соединение

source: No registered devices
ru: Нет зарегистрированных устройств

source: Login
ru: Авторизоваться

source: Register
ru: Зарегистрировать

source: Password
ru: Пароль

source: To Main
ru: На главную

source: Room Connection
ru: Соединение номеров

source: WebSocket URL
ru: URL-адрес веб-сокета

source: Copy
ru: Копировать

source: Connection status
ru: Статус подключения

source: Not connected
ru: Не подключено

source: Scan QR code to connect
ru: Сканируйте QR-код для подключения

source: Connected Users
ru: Подключеные пользователи

source: Refresh
ru: Обновить

source: User
ru: Пользователь

source: Connection Time
ru: Время соедеинения

source: No connected users
ru: Нет подключенных пользователей

source: Total connected users
ru: Всего подключено

source: Connecting
ru: Подключение

source: Connected
ru: Подключено

source: Disconnected
ru: Отключено

source: Connection error
ru: Ошибка подключения

source: Unknown
ru: Неизвестный

source: Copied
ru: Скопировано

source: My Rooms
ru: Мои комнаты

source: Create New Room
ru: Создать новую комнату

source: Room Name
ru: Название комнаты

source: Create
ru: Создавать

source: You have no rooms yet
ru: У вас еще нет комнат

source: Create user
ru: Создать пользователя

source: Available configurations
ru: Доступные конфигурации

source: Select the configurations you can use. The owner (you) always has access.
ru: Выберите доступные вам настройки. Владелец (вы) всегда имеет доступ.

source: Your users
ru: Ваши пользователи

source: No users yet
ru: Пока нет пользователей

source: New password(optional)
ru: Новый пароль(необязательно)

source: Accesses
ru: Доступы

source: Designer
ru: Конфигуратор

source: Repo
ru: Репозиторий

source: Settings
ru: Настройки

source: Update configurations
ru: Обновить конфигурации

source: Profile
ru: Редактировать профиль

source: No configurations yet...
ru: Пока нет конфигураций

source: Back to list
ru: Назад к списку

source: Save and close
ru: Сохранить и закрыть

source: Close
ru: Закрыть

source: Info
ru: Инфо

source: User configurations (Repo)
ru: Пользовательские конфигураци

source: Add from local server
ru: Добавить с локального сервера

source: Add via link
ru: Добавить через ссылку

source: Configuration link
ru: Ссылка конфигурации

source: Select configurations
ru: Выбрать конфигурацию

source: Adding the current database configuration to the repository.
ru: Добавить конфигурацию в репозиторий

source: Selecting the current server configuration
ru: Выбор конфигурации этого сервера

source: Update
ru: Обновить

source: Add selected
ru: Добавить выбранные

source: No Configurations yet
ru: Пока нет конфигураций

source: No configurations added. Open the repository.
ru: КОнфигурации не добавлены. Откройте репозиторий

source: and add a link to
ru: и добавьте конфигурацию

source: auto refresh
ru: Автообновление

source: Table
ru: Таблица

source: Grid
ru: Карточки

source: New
ru: Новый

source: Delete selected
ru: Удалить выбранные

source: Interface language
ru: Язык интерфейса

source: Barcode scanner
ru: Сканер штрихкода

source: External utility
ru: Внешняя утилита

source: starts a local WS-server, and the browser connects to it.
ru: запускает локальный WS-сервер, и браузер коннектиться к ней

source: Enable connection to scanner
ru: Включить соединение со сканером штрихкода

source: URL WebSocket
ru: URL-адрес веб-сокета

source: Example
ru: Пример

source: Check connection
ru: Проверить соединение
